STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_camera.c
/** @defgroup CAMERA_Private_Variables Private Variables
  * @{
  */
static CAMERA_Drv_t *CameraDrv = NULL;
static void         *CompObj = NULL;
static CAMERA_Capabilities_t *CameraCap;

#ifdef USE_STMIPID02
static STMIPID02_Drv_t *DeSerializerDrv = NULL;
static void           *CompObj2 = NULL;
#endif /* USE_STMIPID02 */
/**
  * @}
  */

/** @defgroup CAMERA_Private_FunctionsPrototypes Private Functions Prototypes
  * @{
  */

#ifdef USE_CAMERA_SENSOR_S5K5CAG
static S5K5CAG_Object_t   S5K5CAGObj = { 0 };
static int32_t S5K5CAG_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif /* USE_CAMERA_SENSOR_S5K5CAG */

#ifdef USE_CAMERA_SENSOR_OV5640
static OV5640_Object_t   OV5640Obj = { 0 };
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif /* USE_CAMERA_SENSOR_OV5640 */

#ifdef USE_CAMERA_SENSOR_GC2145
static GC2145_Object_t   GC2145Obj = { 0 };
static int32_t GC2145_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif /* USE_CAMERA_SENSOR_GC2145 */

#ifdef USE_STMIPID02
static STMIPID02_Object_t   STMIPID02Obj = { 0 };
static int32_t STMIPID02_ClkEnable(void);
static int32_t STMIPID02_Probe(uint8_t PixelFormat);
#endif /* USE_STMIPID02 */

/**
  * @}
  */

/** @addtogroup CAMERA_Exported_Functions

  * @{
  */
/**
  * @brief  Initializes the camera.
  * @param  Instance    Camera instance.
  * @param  Resolution  Camera sensor requested resolution (x, y) : standard resolution
  *         naming QQVGA, QVGA, VGA ...
  * @param  PixelFormat Capture pixel format
  * @retval BSP status
  */
int32_t BSP_CAMERA_Init(uint32_t Instance, uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (BSP_CAMERA_HwReset(0) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_BUS_FAILURE;
  }

  /* Read ID of Camera module via I2C */
#ifdef USE_CAMERA_SENSOR_S5K5CAG
  ret = S5K5CAG_Probe(Resolution, PixelFormat);
#endif /* USE_CAMERA_SENSOR_S5K5CAG */

#ifdef USE_CAMERA_SENSOR_OV5640
  ret = OV5640_Probe(Resolution, PixelFormat);
#endif /* USE_CAMERA_SENSOR_OV5640 */

#ifdef USE_CAMERA_SENSOR_GC2145
  ret = GC2145_Probe(Resolution, PixelFormat);
#endif /* USE_CAMERA_SENSOR_GC2145 */

  if (ret != BSP_ERROR_NONE)
  {
    return BSP_ERROR_UNKNOWN_COMPONENT;
  }

#ifdef USE_STMIPID02

  if (STMIPID02_ClkEnable() != BSP_ERROR_NONE) /* if Camera is OK setup the DeSerializer. */
  {
    return BSP_ERROR_BUS_FAILURE;
  }

  ret = STMIPID02_Probe(PixelFormat);

  if (ret != BSP_ERROR_NONE)
  {
    return BSP_ERROR_UNKNOWN_COMPONENT;
  }

#endif /* USE_STMIPID02 */

  CameraCtx[Instance].Resolution = Resolution;
  CameraCtx[Instance].PixelFormat = PixelFormat;

  /* BSP status */
  return BSP_ERROR_NONE;
}

/**
  * @brief  DeInitializes the camera.
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DeInit(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  /* First stop the camera to insure all data are transferred */
  ret = BSP_CAMERA_Stop(Instance);
  if (ret != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Return BSP status */
  return BSP_ERROR_NONE;
}

/**
  * @brief  Starts the camera capture in continuous mode.
  * @param  Instance Camera instance.
  * @param  pBff     pointer to the camera output buffer
  * @param  Mode CAMERA_MODE_CONTINUOUS or CAMERA_MODE_SNAPSHOT
  */
int32_t BSP_CAMERA_Start(uint32_t Instance, uint8_t *pBff, uint32_t Mode)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief  Stop the CAMERA capture
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_Stop(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

#ifdef USE_CAMERA_SENSOR_OV5640
  CameraDrv = (CAMERA_Drv_t *) &OV5640_CAMERA_Driver;
  CompObj = &OV5640Obj;

  ret = CameraDrv->DeInit(CompObj);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  CompObj = NULL;
#endif /* USE_CAMERA_SENSOR_OV5640 */

#ifdef USE_CAMERA_SENSOR_GC2145
  CameraDrv = (CAMERA_Drv_t *) &GC2145_CAMERA_Driver;
  CompObj = &GC2145Obj;

  ret = CameraDrv->DeInit(CompObj);
  if (ret != GC2145_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  CompObj = NULL;
#endif /* USE_CAMERA_SENSOR_GC2145 */

#ifdef USE_STMIPID02
  DeSerializerDrv = (STMIPID02_Drv_t *) &STMIPID02_Driver;
  CompObj2 = &STMIPID02Obj;

  ret = DeSerializerDrv->DeInit(CompObj2);

  if (ret != STMIPID02_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if (BSP_IO_WritePin(0, STMIPID02_XSDN_PIN, IO_PIN_RESET) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }

  CompObj2 = NULL;

#endif /* USE_STMIPID02 */

  return BSP_ERROR_NONE;
}

/**
  * @brief Suspend the CAMERA capture
  * @param  Instance Camera instance.
  */
int32_t BSP_CAMERA_Suspend(uint32_t Instance)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief Resume the CAMERA capture
  * @param  Instance Camera instance.
  */
int32_t BSP_CAMERA_Resume(uint32_t Instance)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief  Get the Camera Capabilities.
  * @param  Instance  Camera instance.
  * @param  Capabilities  pointer to camera Capabilities
  * @note   This function should be called after the init. This to get Capabilities
  *         from the right camera sensor(S5K5CAG or OV5640)
  * @retval Component status
  */
int32_t BSP_CAMERA_GetCapabilities(uint32_t Instance, CAMERA_Capabilities_t *Capabilities)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  ret = CameraDrv->GetCapabilities(CompObj, Capabilities);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

