STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_camera.c
  }
#endif /* MCP_IOEXPANDER */

  return ret;
}

/**
  * @}
  */

/** @defgroup CAMERA_Private_Functions Private Functions
  * @{
  */

/**
  * @brief  Get the capture size in pixels unit.
  * @param  Resolution  the current resolution.
  * @param  PixelFormat Camera pixel format
  * @retval capture size in pixels unit.
  */
int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat)
{
  uint32_t size = 0;
  uint32_t pf_div;
  if (PixelFormat == CAMERA_PF_RGB888)
  {
    pf_div = 3; /* each pixel on 3 bytes so 3/4 words */
  }
  else
  {
    pf_div = 2; /* each pixel on 2 bytes so 1/2 words*/
  }
  /* Get capture size */
  switch (Resolution)
  {
    case CAMERA_R160x120:
      size = ((uint32_t)(160 * 120) * pf_div);
      break;
    case CAMERA_R320x240:
      size = ((uint32_t)(320 * 240) * pf_div);
      break;
    case CAMERA_R480x272:
      size = ((uint32_t)(480 * 272) * pf_div);
      break;
    case CAMERA_R640x480:
      size = ((uint32_t)(640 * 480) * pf_div);
      break;
    case CAMERA_R800x480:
      size = ((uint32_t)(800 * 480) * pf_div);
      break;
    default:
      break;
  }

  return (int32_t)size;
}

/**
  * @}
  */

/** @addtogroup _CAMERA_Private_FunctionPrototypes
  * @{
  */
#ifdef USE_CAMERA_SENSOR_S5K5CAG
/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
static int32_t S5K5CAG_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  S5K5CAG_IO_t              IOCtx;
  uint32_t                 id;

  /* Configure the audio driver */
  IOCtx.Address     = CAMERA_S5K5CAG_ADDRESS;
  IOCtx.Init        = BSP_I2C1_Init;
  IOCtx.DeInit      = BSP_I2C1_DeInit;
  IOCtx.ReadReg     = BSP_I2C1_ReadReg16;
  IOCtx.WriteReg    = BSP_I2C1_WriteReg16;
  IOCtx.GetTick     = BSP_GetTick;

  ret = S5K5CAG_RegisterBusIO(&S5K5CAGObj, &IOCtx);
  if (ret != S5K5CAG_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = S5K5CAG_ReadID(&S5K5CAGObj, &id);
  if (ret != S5K5CAG_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if (id != (uint32_t)S5K5CAG_ID)
  {
    return BSP_ERROR_UNKNOWN_COMPONENT;
  }

  CameraDrv = (CAMERA_Drv_t *) &S5K5CAG_CAMERA_Driver;
  CompObj = &S5K5CAGObj;
  CameraCap = &Cap ;
  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != S5K5CAG_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != S5K5CAG_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif /* USE_CAMERA_SENSOR_S5K5CAG */

#ifdef USE_CAMERA_SENSOR_OV5640
/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
/* #warning !!! On FPGA, OV5640 pixel clock must be reduced, ensure to apply patch !!! */
/*
diff --git a/ov5640.c b/ov5640.c
index 42e14ee04497..5e5d0471542d 100644
--- a/ov5640.c
+++ b/ov5640.c
@@ -145,8 +145,8 @@ int32_t OV5640_Init(OV5640_Object_t *pObj, uint32_t Resolution, uint32_t PixelFo
     {OV5640_PAD_OUTPUT_ENABLE02, 0xf3},
     {OV5640_SC_PLL_CONTRL0, 0x18},
     {OV5640_SYSTEM_CTROL0, 0x02},
-    {OV5640_SC_PLL_CONTRL1, 0x41},
-    {OV5640_SC_PLL_CONTRL2, 0x60},
+    {OV5640_SC_PLL_CONTRL1, 0x40},
+    {OV5640_SC_PLL_CONTRL2, 0x04},
     {OV5640_SC_PLL_CONTRL3, 0x13},
     {OV5640_SYSTEM_ROOT_DIVIDER, 0x01},
     {0x3630, 0x36},
 */
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  OV5640_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (CompObj)
  {
    goto init;
  }

  /* Configure the i2c driver */
  IOCtx.Address     = CAMERA_OV5640_ADDRESS;
  IOCtx.Init        = BSP_I2C5_Init;
  IOCtx.DeInit      = BSP_I2C5_DeInit;
  IOCtx.ReadReg     = BSP_I2C5_ReadReg16;
  IOCtx.WriteReg    = BSP_I2C5_WriteReg16;
  IOCtx.GetTick     = BSP_GetTick;

  ret = OV5640_RegisterBusIO(&OV5640Obj, &IOCtx);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = OV5640_ReadID(&OV5640Obj, &id);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if (id != OV5640_ID)
  {
    return BSP_ERROR_UNKNOWN_COMPONENT;
  }

  CameraDrv = (CAMERA_Drv_t *) &OV5640_CAMERA_Driver;
  CompObj = &OV5640Obj;
  CameraCap = &Cap;

init:
  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif /* USE_CAMERA_SENSOR_OV5640 */

#ifdef USE_CAMERA_SENSOR_GC2145
/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
static int32_t GC2145_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  GC2145_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (CompObj)
  {
    goto init;
  }

  /* Configure the i2c driver */
  IOCtx.Address     = CAMERA_GC2145_ADDRESS;
  IOCtx.Init        = BSP_I2C5_Init;
  IOCtx.DeInit      = BSP_I2C5_DeInit;
  IOCtx.ReadReg     = BSP_I2C5_ReadReg;
  IOCtx.WriteReg    = BSP_I2C5_WriteReg;
  IOCtx.GetTick     = BSP_GetTick;

  ret = GC2145_RegisterBusIO(&GC2145Obj, &IOCtx);
  if (ret != GC2145_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* A delay of 1ms is given because camera sometimes
    fails to respond to ReadID when first time powered up. */
  HAL_Delay(1);

  ret = GC2145_ReadID(&GC2145Obj, &id);

  if (ret != GC2145_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if (id != GC2145_ID)
  {
    return BSP_ERROR_UNKNOWN_COMPONENT;
  }

  CameraDrv = (CAMERA_Drv_t *) &GC2145_CAMERA_Driver;
  CompObj = &GC2145Obj;
  CameraCap = &Cap;

init:
  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != GC2145_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != GC2145_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

