STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_camera.c
  return BSP_ERROR_NONE;
}
#endif /* USE_CAMERA_SENSOR_GC2145 */

int32_t BSP_CAMERA_SetColorbarMode(uint32_t Instance, uint32_t Mode)
{
#ifdef USE_CAMERA_SENSOR_OV5640
  if (OV5640_ColorbarModeConfig(CompObj, Mode) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_CAMERA_SENSOR_OV5640 */
}

int32_t BSP_CAMERA_SetPolarities(uint32_t Instance, uint32_t Pclk, uint32_t Href, uint32_t Vsync)
{
#ifdef USE_CAMERA_SENSOR_OV5640
  if (OV5640_SetPolarities(CompObj,
                           Pclk ? OV5640_POLARITY_PCLK_HIGH : OV5640_POLARITY_PCLK_LOW,
                           Href ? OV5640_POLARITY_HREF_HIGH : OV5640_POLARITY_HREF_LOW,
                           Vsync ? OV5640_POLARITY_VSYNC_HIGH : OV5640_POLARITY_VSYNC_LOW) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_CAMERA_SENSOR_OV5640 */
}
int32_t BSP_CAMERA_SetSynchroCodes(uint32_t Instance, uint32_t FSC, uint32_t LSC, uint32_t LEC, uint32_t FEC)
{
#ifdef USE_CAMERA_SENSOR_OV5640
  OV5640_SyncCodes_t SyncCode;

  SyncCode.FrameStartCode = FSC;
  SyncCode.LineStartCode = LSC;
  SyncCode.LineEndCode = LEC;
  SyncCode.FrameEndCode = FEC;

  if (OV5640_EmbeddedSynchroConfig(CompObj, &SyncCode) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_CAMERA_SENSOR_OV5640 */
}

/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
static int32_t STMIPID02_Probe(uint8_t PixelFormat)
{
  int32_t ret;
  STMIPID02_IO_t            IOCtx;

  /* Only perform the init if the object already exist */
  if (CompObj2)
  {
    goto init;
  }

  /* Configure the i2c driver */
  IOCtx.Address     = STMIPID02_ADDRESS;
  IOCtx.Init        = BSP_I2C5_Init;
  IOCtx.DeInit      = BSP_I2C5_DeInit;
  IOCtx.ReadReg     = BSP_I2C5_ReadReg16;
  IOCtx.WriteReg    = BSP_I2C5_WriteReg16;
  IOCtx.GetTick     = BSP_GetTick;

  ret = STMIPID02_RegisterBusIO(&STMIPID02Obj, &IOCtx);
  if (ret != STMIPID02_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  DeSerializerDrv = (STMIPID02_Drv_t *) &STMIPID02_Driver;
  CompObj2 = &STMIPID02Obj;

init:
  ret = DeSerializerDrv->Init(CompObj2, PixelFormat);
  if (ret != STMIPID02_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

static int32_t STMIPID02_ClkEnable(void)
{
  int32_t          ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef gpio_init_structure;
  BSP_IO_Init_t    io_init_structure;

#if defined (MCP_IOEXPANDER)
  /* Configure IO functionalities for XSDN pin */
  if (BSP_IOEXPANDER_Init(0, IOEXPANDER_IO_MODE) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  io_init_structure.Mode = IO_MODE_OUTPUT_PP;
  io_init_structure.Pin  = STMIPID02_XSDN_PIN;
  io_init_structure.Pull = IO_PULLDOWN;

  if (BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else
  {
    if (BSP_IO_WritePin(0, STMIPID02_XSDN_PIN, IO_PIN_SET) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
  }
  HAL_Delay(10);
  BSP_IO_WritePin(0, STMIPID02_XSDN_PIN, IO_PIN_RESET);
  HAL_Delay(10);
  BSP_IO_WritePin(0, STMIPID02_XSDN_PIN, IO_PIN_SET);
#endif /* MCP_IOEXPANDER */

  gpio_init_structure.Pin       = STMIPID02_CLK_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio_init_structure.Alternate = GPIO_AF0_MCO1;
  HAL_GPIO_Init(STMIPID02_CLK_PORT, &gpio_init_structure);

  /* Enable external clock for STMIPID02 */
  HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);

  return ret;
}

void HAL_DCMIPP_MspInit(DCMIPP_HandleTypeDef *pHdcmipp)
{
  GPIO_InitTypeDef gpio_init_structure;

  /*** Enable peripherals clocks and reset ***/
  __HAL_RCC_DCMIPP_CLK_ENABLE();
  __HAL_RCC_DCMIPP_CLK_SLEEP_DISABLE();
  __HAL_RCC_DCMIPP_RELEASE_RESET();

  /* Enable GPIO clocks */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();

  __HAL_RCC_SYSCFG_CLK_ENABLE();

  /*** Configure the GPIO ***/
  /* Configure DCMI GPIO as alternate function */
  /* D0=PA9 AF13 */
  gpio_init_structure.Pin       = GPIO_PIN_9;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOA, &gpio_init_structure);

  /* PIXCLK=PB7 AF14 */
  gpio_init_structure.Pin       = GPIO_PIN_7;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF14_DCMIPP;
  HAL_GPIO_Init(GPIOB, &gpio_init_structure);

  /* D6=PB8 AF13 */
  gpio_init_structure.Pin       = GPIO_PIN_8;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOB, &gpio_init_structure);

  /* D1=PD0 AF13, D5=PD3 AF13*/
  gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_3;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOD, &gpio_init_structure);

  /* D4=PD11 AF14 */
  gpio_init_structure.Pin       = GPIO_PIN_11;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF14_DCMIPP;
  HAL_GPIO_Init(GPIOD, &gpio_init_structure);

  /* D7=PE14 AF13 */
  gpio_init_structure.Pin       = GPIO_PIN_14;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOE, &gpio_init_structure);

  /* D3=PE4 AF13 */
  gpio_init_structure.Pin       = GPIO_PIN_4;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOE, &gpio_init_structure);

  /* HSYNC=PH8 AF13 */
  gpio_init_structure.Pin       = GPIO_PIN_8;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOH, &gpio_init_structure);

  /* VSYNC=PG9 AF13, D2=PG10 AF13 */
  gpio_init_structure.Pin       = GPIO_PIN_9 | GPIO_PIN_10;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMIPP;
  HAL_GPIO_Init(GPIOG, &gpio_init_structure);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
